---
kind: type
id: T:Autodesk.Revit.DB.Architecture.CutMarkSymbol
source: html/0224e2d5-442a-8efe-a9c2-8cc7fb652525.htm
---
# Autodesk.Revit.DB.Architecture.CutMarkSymbol

The available shapes for the cut mark symbol.

## Syntax (C#)
```csharp
public enum CutMarkSymbol
```